markluo0311/nrf52832_bt_mesh/mesh/src/prov/prov_bearer_adv.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stddef.h>
#include <string.h>

#include "prov_bearer.h"
#include "prov_bearer_adv.h"

#include "nrf_mesh_assert.h"
#include "nrf_mesh_config_prov.h"
#include "nrf_mesh_prov.h"
#include "nrf_mesh_configure.h"
#include "nrf_mesh.h"

#include "log.h"
#include "packet.h"
#include "packet_mgr.h"
#include "rand.h"
#include "timer_scheduler.h"
#include "toolchain.h"
#include "utils.h"
#include "provisioning.h"
#include "prov_beacon.h"
#include "prov_pdu.h"

#include "bearer_adv.h"

/*****************************************************************************
* Local defines
*****************************************************************************/

/**
 * @defgroup PB_ADV_PACKET_LENGTHS
 * Various lengths and overheads in the PB-ADV packets
 * @{
 */

/** PB-ADV packet overhead */
#define PB_ADV_PACKET_OVERHEAD                                  (4 /* Link ID */ + 1 /* Transaction number */)
/** Overhead before payload of a transaction start packet. */
#define PROV_BEARER_PACKET_TRANSACTION_START_OVERHEAD           (1 /* SegN+GPCF */ + 2 /* Total len */ + 1 /* FCS */)
/** Length of a transaction ack packet. */
#define PROV_BEARER_PACKET_TRANSACTION_ACK_LEN                  (1 /* SegN+GPCF */)
/** Overhead before payload of a transaction continuation packet. */
#define PROV_BEARER_PACKET_TRANSACTION_CONTINUATION_OVERHEAD    (1 /* SegN+GPCF */)
/** Length of a link open packet. */
#define PROV_BEARER_PACKET_LINK_OPEN_LEN                        (1 /* Control ID+GPCF */ + NRF_MESH_UUID_SIZE)
/** Length of a link ack packet. */
#define PROV_BEARER_PACKET_LINK_ACK_LEN                         (1 /* Control ID+GPCF */)
/** Length of a link close packet. */
#define PROV_BEARER_PACKET_LINK_CLOSE_LEN                       (1 /* Control ID+GPCF */ + 1 /* Reason */)

/** Maximum payload length of a transaction start packet */
#define PROV_BEARER_ADV_PACKET_START_PAYLOAD_MAXLEN             (BLE_ADV_PACKET_PAYLOAD_MAX_LENGTH - \
        (sizeof(ble_ad_data_t) + PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_TRANSACTION_START_OVERHEAD))
/** Maximum payload length of a transaction continuation packet */
#define PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN      (BLE_ADV_PACKET_PAYLOAD_MAX_LENGTH - \
        (sizeof(ble_ad_data_t) + PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_TRANSACTION_CONTINUATION_OVERHEAD))

/* Assert payload sizes against Bluetooth Mesh core spec (d09419) tables 5.2, 5.4, 5.5, and 5.7 */
NRF_MESH_STATIC_ASSERT(PROV_BEARER_ADV_PACKET_START_PAYLOAD_MAXLEN == 20);
NRF_MESH_STATIC_ASSERT(PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN == 23);

/** @} */

/** Unprovisioned beacon advertisement interval min. */
#define PROV_BEARER_ADV_INT_MIN_UNPROV_BEACON_MS                (NRF_MESH_UNPROV_BEACON_INTERVAL_MS)
/** Unprovisioned beacon advertisement interval max. */
#define PROV_BEARER_ADV_INT_MAX_UNPROV_BEACON_MS                (NRF_MESH_UNPROV_BEACON_INTERVAL_MS + 10)

/** Link close TX retry interval. */
#define PROV_BEARER_ADV_LINK_CLOSE_RETRY_INTERVAL_US            ( 1000000)
/** Time before a transaction is given up. */
#define PROV_BEARER_ADV_TRANSACTION_TIMEOUT_US                  (30000000)
/** Transaction TX retry interval. */
#define PROV_BEARER_ADV_TRANSACTION_BASE_RETRY_INTERVAL_US      ( 2000000)
/** Number of repeats when sending a packet for unacked messages, such as LINK_CLOSE. */
#define PROV_BEARER_ADV_UNACKED_REPEAT_COUNT                    (4)

/**
 * @defgroup PB_ADV_PACKET_CONTROL_FIELD_VALUES
 * Recognized control field values in the PB-ADV packets.
 * @{
 */

/** Control field value for start packets. */
#define PB_ADV_PACKET_C_TRANSACTION_START       (0)
/** Control field value for transaction ack packets. */
#define PB_ADV_PACKET_C_TRANSACTION_ACK         (1)
/** Control field value for transaction continue packets. */
#define PB_ADV_PACKET_C_TRANSACTION_CONTINUE    (2)
/** Control field value for control packets. */
#define PB_ADV_PACKET_C_CONTROL                 (3)

/** @} */

/**
 * @defgroup PB_ADV_PACKET_CONTROL_ID_VALUES
 * Recognized control packet values
 * @{
 */

/** PB-ADV control id for the link open request packet. */
#define PB_ADV_PACKET_CONTROL_ID_LINK_OPEN      (0x00)
/** PB-ADV control id for the link acknowledgment packet. */
#define PB_ADV_PACKET_CONTROL_ID_LINK_ACK       (0x01)
/** PB-ADV control id for the link close indication packet. */
#define PB_ADV_PACKET_CONTROL_ID_LINK_CLOSE     (0x02)

/** @} */

#define PB_ADV_TRANSACTION_NUMBER_PROVISIONER_START  (0x00) /**< Initial value of provisioner transaction number. */
#define PB_ADV_TRANSACTION_NUMBER_PROVISIONEE_START  (0x80) /**< Initial value of provisionee transaction number. */
/*****************************************************************************
* Local type declarations
*****************************************************************************/
/*lint -align_max(push) -align_max(1) */

/** Payload of a generic control packet. */
typedef union __attribute((packed))
{
    struct __attribute((packed))
    {
        uint8_t uuid[NRF_MESH_UUID_SIZE]; /**< Advertised device UUID of device to open link to. */
    } link_open;
    struct __attribute((packed))
    {
        uint8_t reason; /**< Reason for closing the link. See @ref nrf_mesh_prov_link_close_reason_t for valid values. */
    } link_close;
} prov_generic_control_t;

/** Payload of a generic transaction packet. */
typedef union __attribute((packed))
{
    struct __attribute((packed))
    {
        uint16_t total_length;                                         /**< Total length of the provisioning PDU. */
        uint8_t  fcs;                                                  /**< Frame Check Sequence, 8 bit CRC for the complete packet. */
        uint8_t  payload[PROV_BEARER_ADV_PACKET_START_PAYLOAD_MAXLEN]; /**< Packet payload. */
    } start;
    struct __attribute((packed))
    {
        uint8_t  payload[PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN];     /**< Packet payload. */
    } continuation;
} prov_generic_transaction_t;

