markluo0311/nrf52832_bt_mesh/mesh/src/prov/prov_bearer_adv.c
/** Generic provisioning PDU, as defined in the Bluetooth Mesh specification. */
typedef struct __attribute((packed))
{
    uint8_t control : 2; /**< Control field for packet type, see @ref PB_ADV_PACKET_CONTROL_FIELD_VALUES for recognized values. */
    uint8_t id      : 6; /**< Packet ID field, holds one of @ref PB_ADV_PACKET_CONTROL_ID_VALUES for control packets, segment number for transaction packets. */
    union __attribute((packed))
    {
        prov_generic_control_t      control;     /**< Payload of a control PDU. */
        prov_generic_transaction_t  transaction; /**< Payload of a transaction PDU. */
    } payload;
} prov_generic_pdu_t;

typedef struct __attribute((packed))
{
    uint32_t link_id;
    uint8_t transaction_number;
    prov_generic_pdu_t pdu;
} pb_adv_pdu_t;

NRF_MESH_STATIC_ASSERT(PROV_BEARER_ADV_UNACKED_REPEAT_COUNT >= 3);

/*lint -align_max(pop) */
/*****************************************************************************
* Static globals
*****************************************************************************/
static prov_bearer_adv_t * mp_bearer_head; /**< Head of adv bearer linked list */
/*****************************************************************************
* Static functions
*****************************************************************************/
static void tx_retry_cb(timestamp_t timestamp, void * p_context);
static void adv_queue_empty_cb(advertiser_t * p_adv);
static void close_link(prov_bearer_adv_t * p_pb_adv, nrf_mesh_prov_link_close_reason_t reason);

static void prov_bearer_adv_link_close(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason);

/**
 * Calculates the FCS CRC based on 3GPP TS 27.010, as required by mesh core spec.
 * See section 5.3.1.1 (d09r19).
 *
 * @note The function is not static but it's not public either, it should only be
 *       accessed by the unit test.
 *
 * @param p_input Pointer to the start of the input data.
 * @param size Size of the input data.
 * @returns The CRC of the input data.
 */
uint8_t calculate_3GPP_CRC(const uint8_t * p_input, uint16_t size)
{
    /* CRC lookup table lifted from the 3GPP TS27.010 specification, used for FCS generation. */
    static const uint8_t crctable[256] = {
        0x00, 0x91, 0xE3, 0x72, 0x07, 0x96, 0xE4, 0x75, 0x0E, 0x9F, 0xED, 0x7C, 0x09, 0x98, 0xEA, 0x7B,
        0x1C, 0x8D, 0xFF, 0x6E, 0x1B, 0x8A, 0xF8, 0x69, 0x12, 0x83, 0xF1, 0x60, 0x15, 0x84, 0xF6, 0x67,
        0x38, 0xA9, 0xDB, 0x4A, 0x3F, 0xAE, 0xDC, 0x4D, 0x36, 0xA7, 0xD5, 0x44, 0x31, 0xA0, 0xD2, 0x43,
        0x24, 0xB5, 0xC7, 0x56, 0x23, 0xB2, 0xC0, 0x51, 0x2A, 0xBB, 0xC9, 0x58, 0x2D, 0xBC, 0xCE, 0x5F,
        0x70, 0xE1, 0x93, 0x02, 0x77, 0xE6, 0x94, 0x05, 0x7E, 0xEF, 0x9D, 0x0C, 0x79, 0xE8, 0x9A, 0x0B,
        0x6C, 0xFD, 0x8F, 0x1E, 0x6B, 0xFA, 0x88, 0x19, 0x62, 0xF3, 0x81, 0x10, 0x65, 0xF4, 0x86, 0x17,
        0x48, 0xD9, 0xAB, 0x3A, 0x4F, 0xDE, 0xAC, 0x3D, 0x46, 0xD7, 0xA5, 0x34, 0x41, 0xD0, 0xA2, 0x33,
        0x54, 0xC5, 0xB7, 0x26, 0x53, 0xC2, 0xB0, 0x21, 0x5A, 0xCB, 0xB9, 0x28, 0x5D, 0xCC, 0xBE, 0x2F,
        0xE0, 0x71, 0x03, 0x92, 0xE7, 0x76, 0x04, 0x95, 0xEE, 0x7F, 0x0D, 0x9C, 0xE9, 0x78, 0x0A, 0x9B,
        0xFC, 0x6D, 0x1F, 0x8E, 0xFB, 0x6A, 0x18, 0x89, 0xF2, 0x63, 0x11, 0x80, 0xF5, 0x64, 0x16, 0x87,
        0xD8, 0x49, 0x3B, 0xAA, 0xDF, 0x4E, 0x3C, 0xAD, 0xD6, 0x47, 0x35, 0xA4, 0xD1, 0x40, 0x32, 0xA3,
        0xC4, 0x55, 0x27, 0xB6, 0xC3, 0x52, 0x20, 0xB1, 0xCA, 0x5B, 0x29, 0xB8, 0xCD, 0x5C, 0x2E, 0xBF,
        0x90, 0x01, 0x73, 0xE2, 0x97, 0x06, 0x74, 0xE5, 0x9E, 0x0F, 0x7D, 0xEC, 0x99, 0x08, 0x7A, 0xEB,
        0x8C, 0x1D, 0x6F, 0xFE, 0x8B, 0x1A, 0x68, 0xF9, 0x82, 0x13, 0x61, 0xF0, 0x85, 0x14, 0x66, 0xF7,
        0xA8, 0x39, 0x4B, 0xDA, 0xAF, 0x3E, 0x4C, 0xDD, 0xA6, 0x37, 0x45, 0xD4, 0xA1, 0x30, 0x42, 0xD3,
        0xB4, 0x25, 0x57, 0xC6, 0xB3, 0x22, 0x50, 0xC1, 0xBA, 0x2B, 0x59, 0xC8, 0xBD, 0x2C, 0x5E, 0xCF
    };

    uint8_t fcs = 0xff;

    for (int i = 0; i < size; ++i)
    {
        fcs = crctable[fcs ^ p_input[i]];
    }

    return 0xff - fcs;
}

/** Reset/postpone the link timeout timer. */
static inline void reset_timeout_timer(prov_bearer_adv_t * p_bearer)
{
    timer_sch_reschedule(&p_bearer->link_timeout_event, timer_now() + p_bearer->link_timeout);
}

/** Link timeout timer call back, called by the timer_scheduler modeule.
  * This will be called if a PDU is not received before the timeout expires,
  * then the protocol has failed.
  */
static void link_timeout_cb(timestamp_t timestamp, void * p_context)
{
    prov_bearer_t * p_bearer = prov_bearer_adv_parent_get((prov_bearer_adv_t *) p_context);
    prov_link_close(p_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT);
}

static prov_bearer_adv_t * get_bearer_from_state(prov_bearer_adv_state_t state)
{
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);
    prov_bearer_adv_t * p_pb_adv = mp_bearer_head;
    while (p_pb_adv != NULL)
    {
        if (p_pb_adv->state == state)
        {
            break;
        }
        p_pb_adv = p_pb_adv->p_next;
    }
    _ENABLE_IRQS(was_masked);
    return p_pb_adv;
}

static prov_bearer_adv_t * get_bearer_from_link_id(uint32_t link_id)
{
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);
    prov_bearer_adv_t * p_pb_adv = mp_bearer_head;
    while (p_pb_adv != NULL)
    {
        if (p_pb_adv->link_id == link_id)
        {
            break;
        }
        p_pb_adv = p_pb_adv->p_next;
    }
    _ENABLE_IRQS(was_masked);
    return p_pb_adv;
}

static inline uint8_t transaction_total_segment_count_get(uint32_t total_length)
{
    return 1 +
        (total_length
         - 1
         - PROV_BEARER_ADV_PACKET_START_PAYLOAD_MAXLEN
         + PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN)
        / PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN;
}

static inline void reset_adv_int(prov_bearer_adv_t * p_pb_adv)
{
    p_pb_adv->advertiser.adv_int_max_ms = BEARER_ADV_INT_MAX_MS_DEFAULT;
    p_pb_adv->advertiser.adv_int_min_ms = BEARER_ADV_INT_MIN_MS_DEFAULT;
    /* If this fails, our next advertisement will be delayed. Don't bother
     * handling this, as we'll recover. */
    (void)bearer_adv_interval_reset(&p_pb_adv->advertiser);
}

static void init_bearer_structure(prov_bearer_adv_t * p_pb_adv, uint32_t link_timeout_us)
{
    p_pb_adv->buffer.state = PROV_BEARER_ADV_BUF_STATE_UNUSED;
    p_pb_adv->transaction_out = 0;
    p_pb_adv->transaction_in = 0;
    p_pb_adv->instance_state = PROV_BEARER_ADV_INSTANCE_INITIALIZED;
    p_pb_adv->state = PROV_BEARER_ADV_STATE_IDLE;

    p_pb_adv->timeout_event.cb = tx_retry_cb;
    p_pb_adv->timeout_event.p_context = p_pb_adv;

    p_pb_adv->link_timeout = link_timeout_us;
    p_pb_adv->link_timeout_event.cb = link_timeout_cb;
    p_pb_adv->link_timeout_event.p_context = p_pb_adv;
    p_pb_adv->link_timeout_event.interval = 0;

    p_pb_adv->advertiser.adv_channel_map = NRF_MESH_ADV_CHAN_DEFAULT;
    p_pb_adv->advertiser.adv_int_max_ms = BEARER_ADV_INT_MAX_MS_DEFAULT;
    p_pb_adv->advertiser.adv_int_min_ms = BEARER_ADV_INT_MIN_MS_DEFAULT;
    p_pb_adv->advertiser.adv_packet_type = BLE_PACKET_TYPE_ADV_NONCONN_IND;
    p_pb_adv->advertiser.queue_empty_cb = adv_queue_empty_cb;
    bearer_adv_advertiser_init(&p_pb_adv->advertiser);
}

/**** Link list managment ****/

/**
 * Add a bearer instance to the active bearer list.
 *
 */
static void add_active_bearer(prov_bearer_adv_t * p_pb_adv)
{
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);

    p_pb_adv->p_next = mp_bearer_head;
    mp_bearer_head = p_pb_adv;

    _ENABLE_IRQS(was_masked);

    __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "PB-ADV: context at 0x%.08x added to bearer\n", (uint32_t) p_pb_adv);
}
/**
 * Remove bearer instance from the active bearer list.
 *
 * @warning This function requires that the bearer instance p_pb_adv it not NULL and that
 *          it has already been added to the active list via @ref add_active_bearer.
 *
 */
static void remove_active_bearer(const prov_bearer_adv_t * p_pb_adv)
{
    NRF_MESH_ASSERT(mp_bearer_head != NULL);
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);

