markluo0311/nrf52832_bt_mesh/mesh/src/prov/prov_bearer_adv.c
    if (p_pb_adv == mp_bearer_head)
    {
        mp_bearer_head = p_pb_adv->p_next;
    }
    else
    {
        prov_bearer_adv_t * p_prev = mp_bearer_head;
        while (p_prev->p_next != p_pb_adv)
        {
            /* This should never happen, otherwise it indicates an internal error. */
            NRF_MESH_ASSERT(p_prev->p_next != NULL);
            p_prev = p_prev->p_next;
        }

        p_prev->p_next = p_pb_adv->p_next;
    }

    _ENABLE_IRQS(was_masked);
}

/**** Packet sending ****/

static uint32_t send_unprov_beacon(prov_bearer_adv_t * p_pb_adv, const char * URI, uint16_t oob_info)
{
    packet_t * p_packet = prov_beacon_unprov_build(URI, oob_info);
    if (p_packet == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }

   p_pb_adv->advertiser.adv_int_max_ms = PROV_BEARER_ADV_INT_MAX_UNPROV_BEACON_MS;
   p_pb_adv->advertiser.adv_int_min_ms = PROV_BEARER_ADV_INT_MIN_UNPROV_BEACON_MS;

    uint32_t status = bearer_adv_tx(&p_pb_adv->advertiser, p_packet, BEARER_ADV_REPEAT_INFINITE);
    if (status != NRF_SUCCESS)
    {
        packet_mgr_free(p_packet);
    }
    return status;
}

static packet_t* pb_adv_packet_alloc(uint32_t payload_size)
{
    packet_t * p_packet;
    uint32_t status = packet_mgr_alloc((packet_generic_t **) &p_packet, BLE_ADV_PACKET_OVERHEAD + sizeof(ble_ad_data_t) + payload_size);
    if (status != NRF_SUCCESS)
    {
        return NULL;
    }

    packet_payload_size_set(p_packet, sizeof(ble_ad_data_t) + payload_size);

    return p_packet;
}

static uint32_t send_packet(prov_bearer_adv_t * p_pb_adv, const pb_adv_pdu_t * p_pdu, uint32_t length, uint8_t repeats)
{
    packet_t * p_packet = pb_adv_packet_alloc(length);
    if (p_packet == NULL)
    {
        return NRF_ERROR_NO_MEM;
    }

    /* Build packet: */
    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) &p_packet->payload[0];
    p_ad_data->length = length + BLE_AD_DATA_OVERHEAD;
    p_ad_data->type = AD_TYPE_PB_ADV;
    memcpy(&p_ad_data->data[0], p_pdu, length);

    uint32_t status = bearer_adv_tx(&p_pb_adv->advertiser, p_packet, repeats);
    if (status != NRF_SUCCESS)
    {
        packet_mgr_free(p_packet);
    }
    return status;
}

static uint32_t send_link_open(prov_bearer_adv_t * p_pb_adv, const uint8_t * p_peer_uuid)
{
    pb_adv_pdu_t pb_adv_pdu;
    pb_adv_pdu.link_id = LE2BE32(p_pb_adv->link_id);
    pb_adv_pdu.transaction_number = 0;
    pb_adv_pdu.pdu.control = PB_ADV_PACKET_C_CONTROL;

    pb_adv_pdu.pdu.id = PB_ADV_PACKET_CONTROL_ID_LINK_OPEN;
    memcpy(pb_adv_pdu.pdu.payload.control.link_open.uuid, p_peer_uuid, NRF_MESH_UUID_SIZE);

    /* Repeat the packet multiple times, but use long intervals */
    return send_packet(p_pb_adv,
            &pb_adv_pdu,
            PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_LINK_OPEN_LEN,
            PROV_BEARER_ADV_UNACKED_REPEAT_COUNT);
}

static uint32_t send_link_ack(prov_bearer_adv_t * p_pb_adv)
{
    pb_adv_pdu_t pb_adv_pdu;
    pb_adv_pdu.link_id = LE2BE32(p_pb_adv->link_id);
    pb_adv_pdu.transaction_number = 0;
    pb_adv_pdu.pdu.control = PB_ADV_PACKET_C_CONTROL;

    pb_adv_pdu.pdu.id = PB_ADV_PACKET_CONTROL_ID_LINK_ACK;

    return send_packet(p_pb_adv, &pb_adv_pdu, PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_LINK_ACK_LEN, 1);
}

static uint32_t send_link_close(prov_bearer_adv_t * p_pb_adv, nrf_mesh_prov_link_close_reason_t reason)
{
    pb_adv_pdu_t pb_adv_pdu;
    pb_adv_pdu.link_id = LE2BE32(p_pb_adv->link_id);
    pb_adv_pdu.transaction_number = 0;
    pb_adv_pdu.pdu.control = PB_ADV_PACKET_C_CONTROL;

    pb_adv_pdu.pdu.id = PB_ADV_PACKET_CONTROL_ID_LINK_CLOSE;
    pb_adv_pdu.pdu.payload.control.link_close.reason = (uint8_t) reason;

    /* The spec recommends sending the close message at least three times to be sure it's received.*/
    return send_packet(p_pb_adv, &pb_adv_pdu, PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_LINK_CLOSE_LEN, PROV_BEARER_ADV_UNACKED_REPEAT_COUNT);
}

static void send_transaction_ack(prov_bearer_adv_t * p_pb_adv, uint8_t transaction_number)
{
    pb_adv_pdu_t pb_adv_pdu;
    pb_adv_pdu.link_id = LE2BE32(p_pb_adv->link_id);
    pb_adv_pdu.transaction_number = transaction_number;
    pb_adv_pdu.pdu.control = PB_ADV_PACKET_C_TRANSACTION_ACK;
    pb_adv_pdu.pdu.id = 0;

    (void) send_packet(p_pb_adv, &pb_adv_pdu, PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_TRANSACTION_ACK_LEN, 1);
}

static uint32_t send_transaction_start(prov_bearer_adv_t * p_pb_adv)
{
    NRF_MESH_ASSERT(p_pb_adv != NULL);
    NRF_MESH_ASSERT(p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN);
    NRF_MESH_ASSERT(p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_TX);

    uint16_t payload_length;
    if (p_pb_adv->buffer.length > PROV_BEARER_ADV_PACKET_START_PAYLOAD_MAXLEN)
    {
        payload_length = PROV_BEARER_ADV_PACKET_START_PAYLOAD_MAXLEN;
    }
    else
    {
        payload_length = p_pb_adv->buffer.length;
    }

    pb_adv_pdu_t pb_adv_pdu;

    pb_adv_pdu.link_id = LE2BE32(p_pb_adv->link_id);
    pb_adv_pdu.transaction_number = p_pb_adv->transaction_out;
    pb_adv_pdu.pdu.control = PB_ADV_PACKET_C_TRANSACTION_START;
    /* Set the ID field to match the segment number of the last packet we'll
     * send in this transaction. */
    pb_adv_pdu.pdu.id = transaction_total_segment_count_get(p_pb_adv->buffer.length) - 1;
    pb_adv_pdu.pdu.payload.transaction.start.fcs = p_pb_adv->buffer.fcs;
    pb_adv_pdu.pdu.payload.transaction.start.total_length = LE2BE16(p_pb_adv->buffer.length); /*lint !e572 Excessive shift of value. */
    memcpy(pb_adv_pdu.pdu.payload.transaction.start.payload, &p_pb_adv->buffer.payload[0], payload_length);

    uint32_t status = send_packet(p_pb_adv, &pb_adv_pdu, PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_TRANSACTION_START_OVERHEAD + payload_length, 1);
    if (status == NRF_SUCCESS)
    {
        p_pb_adv->buffer.finished_segments = 1;
    }
    return status;
}

static uint32_t send_transaction_continuation(prov_bearer_adv_t * p_pb_adv, uint8_t segment_index)
{
    const uint16_t data_offset = PROV_BEARER_ADV_PACKET_START_PAYLOAD_MAXLEN + ((segment_index - 1) * PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN);
    const uint16_t remaining = p_pb_adv->buffer.length - data_offset;

    uint16_t payload_length;
    if (remaining > PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN)
    {
        payload_length = PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN;
    }
    else
    {
        payload_length = remaining;
    }

    pb_adv_pdu_t pb_adv_pdu;

    pb_adv_pdu.link_id =LE2BE32(p_pb_adv->link_id);
    pb_adv_pdu.transaction_number = p_pb_adv->transaction_out;
    pb_adv_pdu.pdu.control = PB_ADV_PACKET_C_TRANSACTION_CONTINUE;
    pb_adv_pdu.pdu.id = segment_index;
    memcpy(pb_adv_pdu.pdu.payload.transaction.continuation.payload, &p_pb_adv->buffer.payload[data_offset], payload_length);

    uint32_t status = send_packet(p_pb_adv, &pb_adv_pdu, PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_TRANSACTION_CONTINUATION_OVERHEAD + payload_length, 1);
    if (status == NRF_SUCCESS)
    {
        p_pb_adv->buffer.finished_segments++;
    }
    return status;
}

/**** Transaction handling ****/

static void prov_buffer_tx(prov_bearer_adv_t * p_pb_adv)
{
    NRF_MESH_ASSERT(p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_TX);
    uint32_t status;
    /* Only send start packet if we haven't sent any segments yet. */
    if (p_pb_adv->buffer.finished_segments == 0)
    {
        status = send_transaction_start(p_pb_adv);
        if (status != NRF_SUCCESS)
        {
            /* Wait for advertiser queue empty or retry timeout */
            return;
        }
    }
    /* The loop should be able to pick up in the middle of sending. */
    for (uint32_t segment = p_pb_adv->buffer.finished_segments;
            segment < transaction_total_segment_count_get(p_pb_adv->buffer.length);
            segment++)
    {
        status = send_transaction_continuation(p_pb_adv, segment);
        if (status != NRF_SUCCESS)
        {
            /* Wait for advertiser queue empty or retry timeout */
            break;
        }
    }
}

static void prov_buffer_rx(prov_bearer_adv_t * p_pb_adv, prov_bearer_adv_buffer_t * p_buf, uint8_t transaction_number)
{
    NRF_MESH_ASSERT(p_buf->state == PROV_BEARER_ADV_BUF_STATE_RX);

    /* Verify FCS */
    if (p_buf->fcs == calculate_3GPP_CRC(p_buf->payload, p_buf->length))
    {
        /* Send ack, doesn't really matter if it works, the other device side
         * will eventually send again if we fail. */
        send_transaction_ack(p_pb_adv, p_pb_adv->transaction_in);

