markluo0311/nrf52832_bt_mesh/mesh/src/prov/prov_bearer_adv.c
        /* Prepare for next transaction */
        p_buf->finished_segments = 0;
        p_pb_adv->transaction_in = transaction_number + 1;

        /* Copy the buffer to stack, to avoid having a TX call in the
         * callback overwrite the RX data. This could probably be avoided
         * by ensuring that we never look at the incoming data after
         * calling TX in the upper layers, but we can't guarantee this from
         * this module.
         */
        uint32_t length = p_buf->length;
        uint8_t prov_buf[PROV_PDU_MAX_LENGTH];
        memcpy(prov_buf, p_buf->payload, length);
        p_buf->state = PROV_BEARER_ADV_BUF_STATE_UNUSED;

        reset_timeout_timer(p_pb_adv);

        /* Callback to upper layer */
        prov_cb_pkt_in(prov_bearer_adv_parent_get(p_pb_adv), prov_buf, length);
    }
    else
    {
        /* Received with wrong FCS, abort. */
        p_buf->state = PROV_BEARER_ADV_BUF_STATE_UNUSED;
    }
}

/**** Packet handling ****/

static void handle_transaction_start_packet(prov_bearer_adv_t * p_pb_adv, pb_adv_pdu_t * p_packet, uint32_t length)
{
    if (p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_UNUSED)
    {
        if (p_packet->transaction_number >= p_pb_adv->transaction_in)
        {
            /* finished_segments, which is used in handle_transaction_continuation_packet
                is 8-bits hence we are limited to receiving a maximum of 7 segments. */
            p_pb_adv->buffer.length = BE2LE16(p_packet->pdu.payload.transaction.start.total_length);
            uint8_t SegN = transaction_total_segment_count_get(p_pb_adv->buffer.length);
            if (SegN > (sizeof(p_pb_adv->buffer.finished_segments)*8) -1)
            {
                prov_bearer_adv_link_close(prov_bearer_adv_parent_get(p_pb_adv), NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
            }
            else
            {
                /* New message */
                p_pb_adv->buffer.fcs = p_packet->pdu.payload.transaction.start.fcs;
                p_pb_adv->buffer.state = PROV_BEARER_ADV_BUF_STATE_RX;
                p_pb_adv->buffer.finished_segments = 1;
                uint32_t payload_length = length - PB_ADV_PACKET_OVERHEAD - PROV_BEARER_PACKET_TRANSACTION_START_OVERHEAD;
                memcpy(p_pb_adv->buffer.payload, p_packet->pdu.payload.transaction.start.payload, payload_length);

                if (p_pb_adv->buffer.length == payload_length)
                {
                    /* Single segment message */
                    prov_buffer_rx(p_pb_adv, &p_pb_adv->buffer, p_packet->transaction_number);
                }
            }
        }
        else if (p_packet->transaction_number < p_pb_adv->transaction_in)
        {
            __LOG(LOG_SRC_PROV, LOG_LEVEL_DBG1, "Got start packet for a transaction we've already processed, send the ack again.");
            send_transaction_ack(p_pb_adv, p_packet->transaction_number);
        }
        else
        {
            __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Got segment from unexpected transaction number (was %x, previous is %x).\n", p_packet->transaction_number, p_pb_adv->transaction_in);
        }
    }
    else if (p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_TX)
    {
        if (p_packet->transaction_number < p_pb_adv->transaction_in)
        {
            __LOG(LOG_SRC_PROV, LOG_LEVEL_DBG1, "Got start packet for a transaction we've already processed, send the ack again.");
            send_transaction_ack(p_pb_adv, p_packet->transaction_number);
        }
        else if (p_packet->transaction_number > p_pb_adv->transaction_in)
        {
            __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Got segment from unexpected transaction number (was %x, previous is %x).\n", p_packet->transaction_number, p_pb_adv->transaction_in);
        }
        else
        {
            __LOG(LOG_SRC_PROV, LOG_LEVEL_DBG1, "Got the next segment before an ACK for our own (%x, %x)\n", p_packet->transaction_number, p_pb_adv->transaction_in);
        }
    }
    else
    {
        __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Received start segment while already in RX mode.\n");
    }
}

static void handle_transaction_continuation_packet(prov_bearer_adv_t * p_pb_adv, pb_adv_pdu_t * p_packet, uint32_t length)
{
    if (p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_RX)
    {
        if (p_packet->transaction_number == p_pb_adv->transaction_in)
        {
            /* Check segment bitfield, to figure out if we've received this packet before: */
            if (!((1 << p_packet->pdu.id) & p_pb_adv->buffer.finished_segments))
            {
                /* First time we receive this packet. */
                uint32_t data_index = (PROV_BEARER_ADV_PACKET_START_PAYLOAD_MAXLEN + (p_packet->pdu.id - 1) * PROV_BEARER_ADV_PACKET_CONTINUATION_PAYLOAD_MAXLEN);
                uint32_t payload_length = length - PB_ADV_PACKET_OVERHEAD - PROV_BEARER_PACKET_TRANSACTION_CONTINUATION_OVERHEAD;
                memcpy(&p_pb_adv->buffer.payload[data_index], p_packet->pdu.payload.transaction.continuation.payload, payload_length);

                p_pb_adv->buffer.finished_segments |= (1 << p_packet->pdu.id);

                /* Here's some neat bitfield magic for you:
                 * If (and only if) all packets in an N-segment transaction
                 * have been received, the bitmap should have N number of 1's
                 * on the lower half of the bitfield. Adding 1 to this full
                 * bitfield should give a single bit with offset N.
                 * E.g. N=5: 0b00011111 + 1 == 0b00100000 == (1 << 5).
                 * If a single bit is missing, we'll get a different result.
                 */
                if (p_pb_adv->buffer.finished_segments + 1 == (1 << transaction_total_segment_count_get(p_pb_adv->buffer.length)))
                {
                    /* All segments received. */
                    prov_buffer_rx(p_pb_adv, &p_pb_adv->buffer, p_packet->transaction_number);
                }
            }
        }
        else
        {
            __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Got segment from unexpected transaction number.\n");
        }
    }
    else
    {
        if (p_packet->transaction_number < p_pb_adv->transaction_in)
        {
            /* Got packet for a transaction we've already processed, send the ack again. */
            send_transaction_ack(p_pb_adv, p_packet->transaction_number);
        }
        else if (p_packet->transaction_number > p_pb_adv->transaction_in)
        {
            __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Got segment from unexpected transaction number (was %x, next is %x).\n", p_packet->transaction_number, p_pb_adv->transaction_in);
        }
    }
}

