markluo0311/nrf52832_bt_mesh/mesh/src/prov/prov_bearer_adv.c
static void handle_transaction_ack_packet(prov_bearer_adv_t * p_pb_adv, pb_adv_pdu_t * p_packet)
{
    if (p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_TX &&
        p_packet->transaction_number == p_pb_adv->transaction_out)
    {
        __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "Received ACK for [ppdu%x]\n", p_pb_adv->buffer.payload[0]);

        /* Abort retry timer. If it fails, we'll correct it on the next timeout. */
        p_pb_adv->timeout_event.interval = 0;
        timer_sch_abort(&p_pb_adv->timeout_event);

        /* Stop transmitting the transaction. */
        bearer_adv_flush_tx(&p_pb_adv->advertiser);

        /* Bump our transaction number, as this one's finished. */
        p_pb_adv->transaction_out++;
        p_pb_adv->buffer.state = PROV_BEARER_ADV_BUF_STATE_UNUSED;

        reset_timeout_timer(p_pb_adv);
        prov_cb_ack_in(prov_bearer_adv_parent_get(p_pb_adv));
    }
    else
    {
        __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Got unexpected transaction ack\n");
    }
}

static void handle_control_packet(prov_bearer_adv_t * p_pb_adv, pb_adv_pdu_t * p_packet, uint32_t length)
{
    bool packet_len_check;
    switch (p_packet->pdu.id)
    {
        case PB_ADV_PACKET_CONTROL_ID_LINK_OPEN:
            packet_len_check = (length == (PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_LINK_OPEN_LEN));
            if (packet_len_check && memcmp(p_packet->pdu.payload.control.link_open.uuid, nrf_mesh_configure_device_uuid_get(), NRF_MESH_UUID_SIZE) == 0)
            {
                if (p_pb_adv == NULL)
                {
                    /* link ID of the incoming packet didn't match any known link IDs, find an available bearer */
                    p_pb_adv = get_bearer_from_state(PROV_BEARER_ADV_STATE_LISTEN);
                }

                if (p_pb_adv != NULL)
                {
                    if (p_pb_adv->state == PROV_BEARER_ADV_STATE_LISTEN)
                    {
                        p_pb_adv->link_id = BE2LE32(p_packet->link_id);

                        /* Start using short advertisement interval */
                        reset_adv_int(p_pb_adv);
                        /* No need to flush the bearer TX queue, since we sent
                         * the unprov beacon with infinite repeats, making the
                         * next packet replace it. */

                        if (send_link_ack(p_pb_adv) == NRF_SUCCESS)
                        {
                            __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "PB-ADV: Link opened.\n");
                            p_pb_adv->state = PROV_BEARER_ADV_STATE_LINK_OPEN;
                            reset_timeout_timer(p_pb_adv);

                            prov_cb_link_opened(prov_bearer_adv_parent_get(p_pb_adv));
                        }
                        else
                        {
                            p_pb_adv->link_id = 0;
                        }
                    }
                    else if (p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN &&
                            p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_UNUSED)
                    {
                            /* Most likely, the other side missed our first ack, send another. */
                            (void) send_link_ack(p_pb_adv);
                    }
                }
            }
            break;
        case PB_ADV_PACKET_CONTROL_ID_LINK_ACK:
            packet_len_check = (length == (PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_LINK_ACK_LEN));
            if (p_pb_adv != NULL && packet_len_check)
            {
                if (p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPENING)
                {
                    /* Disable the link open transmits. */
                    bearer_adv_flush_tx(&p_pb_adv->advertiser);
                    __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "PB-ADV: Link opened.\n");

                    p_pb_adv->state = PROV_BEARER_ADV_STATE_LINK_OPEN;
                    reset_timeout_timer(p_pb_adv);
                    prov_cb_link_opened(prov_bearer_adv_parent_get(p_pb_adv));
                }
                else
                {
                    __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Received unexpected link ack in PB-ADV state %d\n", p_pb_adv->state);
                }
            }
            break;
        case PB_ADV_PACKET_CONTROL_ID_LINK_CLOSE:
            packet_len_check = (length == (PB_ADV_PACKET_OVERHEAD + PROV_BEARER_PACKET_LINK_CLOSE_LEN));
            if (p_pb_adv != NULL && packet_len_check)
            {
                if (p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPENING ||
                    p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN)
                {
                    /* Cancel any ongoing TX operations. */
                    if (p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_TX)
                    {
                        /* Stop the timer */
                        timer_sch_abort(&p_pb_adv->timeout_event);
                    }
                    close_link(p_pb_adv, (nrf_mesh_prov_link_close_reason_t) p_packet->pdu.payload.control.link_close.reason);
                    __LOG(LOG_SRC_PROV, LOG_LEVEL_INFO, "PB-ADV: Link closed.\n");

                }
                else
                {
                    __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Received unexpected link close in PB-ADV state %d\n", p_pb_adv->state);
                }
            }
            break;
        default:
            __LOG(LOG_SRC_PROV, LOG_LEVEL_WARN, "Received unexpected control packet %x\n", p_packet->pdu.id);
    }
}

/**** Callbacks ****/

static void tx_retry_cb(timestamp_t timestamp, void * p_context)
{
    prov_bearer_adv_t * p_pb_adv = (prov_bearer_adv_t *) p_context;

    if (p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN &&
        p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_TX)
    {
        if (TIMER_OLDER_THAN(p_pb_adv->sar_timeout, timestamp))
        {
            /* We've spent all our retries, and can regard the link as lost */
            if (send_link_close(p_pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT) == NRF_SUCCESS)
            {
                /* Wait for packets to finish sending before actually closing the link. */
                p_pb_adv->state = PROV_BEARER_ADV_STATE_LINK_CLOSING;
                p_pb_adv->close_reason = NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT;

                /* Stop this timeout from retriggering. */
                p_pb_adv->timeout_event.interval = 0;
            }
            else
            {
                /* Couldn't send link close. Shorten the interval, and keep trying. */
                p_pb_adv->timeout_event.interval = PROV_BEARER_ADV_LINK_CLOSE_RETRY_INTERVAL_US;

                /* If we keep failing the link close send, the timer will
                 * eventually roll over, and the TIMER_OLDER_THAN check a few
                 * lines up will give different results. Move the timeout to
                 * the current value, so that we'll always overstep it by some
                 * small amount on the next fire.
                 */
                p_pb_adv->sar_timeout = timestamp;
            }
        }
        else
        {
            __LOG(LOG_SRC_PROV, LOG_LEVEL_DBG1, "TX RETRY: [ppdu%x]\n", p_pb_adv->buffer.payload[0]);
            /* resend entire transaction. */
            p_pb_adv->buffer.finished_segments = 0;
            prov_buffer_tx(p_pb_adv);
        }
    }
    else
    {
        /* The timeout was invalid, set interval to 0 to avoid getting this timeout again. */
        p_pb_adv->timeout_event.interval = 0;
    }
}

static void adv_queue_empty_cb(advertiser_t * p_adv)
{
    prov_bearer_adv_t * p_pb_adv = (prov_bearer_adv_t *) ((uint8_t*) p_adv - offsetof(prov_bearer_adv_t, advertiser));

    if (p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_CLOSING)
    {
        /* We've sent all link close packets, and may close the link if there
         * are no timers about to expire. */
        if (p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_TX)
        {
            timer_sch_abort(&p_pb_adv->timeout_event);
        }
        close_link(p_pb_adv, p_pb_adv->close_reason);
    }
    else if (p_pb_adv->buffer.state == PROV_BEARER_ADV_BUF_STATE_TX)
    {
        /* If there are any segments that haven't been sent, we'll send them now: */
        prov_buffer_tx(p_pb_adv);
    }
}

/**** Misc. ****/

