markluo0311/nrf52832_bt_mesh/mesh/src/prov/prov_bearer_adv.c
static void close_link(prov_bearer_adv_t * p_pb_adv, nrf_mesh_prov_link_close_reason_t reason)
{
    NRF_MESH_ASSERT(p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN ||
                    p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPENING ||
                    p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_CLOSING);

    remove_active_bearer(p_pb_adv);
    NRF_MESH_ASSERT(p_pb_adv->instance_state == PROV_BEARER_ADV_INSTANCE_INITIALIZED);

    bearer_adv_flush_tx(&p_pb_adv->advertiser);
    p_pb_adv->instance_state = PROV_BEARER_ADV_INSTANCE_RELEASED;
    p_pb_adv->buffer.state = PROV_BEARER_ADV_BUF_STATE_UNUSED;
    p_pb_adv->state = PROV_BEARER_ADV_STATE_IDLE;

    timer_sch_abort(&p_pb_adv->link_timeout_event);
    prov_cb_link_closed(prov_bearer_adv_parent_get(p_pb_adv), reason);
}

/**** Interface functions ****/

static uint32_t prov_bearer_adv_listen(prov_bearer_t * p_bearer, const char * URI, uint16_t oob_info, uint32_t link_timeout_us)
{
    NRF_MESH_ASSERT(p_bearer != NULL);
    prov_bearer_adv_t * p_pb_adv = &p_bearer->bearer.pb_adv;

    if (p_pb_adv->instance_state == PROV_BEARER_ADV_INSTANCE_INITIALIZED &&
        p_pb_adv->state != PROV_BEARER_ADV_STATE_IDLE)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    init_bearer_structure(p_pb_adv, link_timeout_us);

    /* Set initial link values */
    p_pb_adv->link_id = 0;
    p_pb_adv->transaction_out = PB_ADV_TRANSACTION_NUMBER_PROVISIONEE_START;
    p_pb_adv->transaction_in  = PB_ADV_TRANSACTION_NUMBER_PROVISIONER_START;

    uint32_t status = send_unprov_beacon(p_pb_adv, URI, oob_info);

    if (status == NRF_SUCCESS)
    {
        add_active_bearer(p_pb_adv);
        p_pb_adv->state = PROV_BEARER_ADV_STATE_LISTEN;
    }
    return status;
}

static uint32_t prov_bearer_adv_listen_stop(prov_bearer_t * p_bearer)
{
    NRF_MESH_ASSERT(p_bearer != NULL);
    prov_bearer_adv_t * p_pb_adv = &p_bearer->bearer.pb_adv;

    if (p_pb_adv->state != PROV_BEARER_ADV_STATE_LISTEN)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    remove_active_bearer(p_pb_adv);
    /* Stop the unprovisioned beacon */
    bearer_adv_flush_tx(&p_pb_adv->advertiser);
    p_pb_adv->state = PROV_BEARER_ADV_STATE_IDLE;
    return NRF_SUCCESS;
}

static uint32_t prov_bearer_adv_link_open(prov_bearer_t * p_bearer, const uint8_t * p_peer_uuid, uint32_t link_timeout_us)
{
    NRF_MESH_ASSERT(p_bearer != NULL);
    prov_bearer_adv_t * p_pb_adv = &p_bearer->bearer.pb_adv;

    if (p_pb_adv->instance_state == PROV_BEARER_ADV_INSTANCE_INITIALIZED &&
        p_pb_adv->state != PROV_BEARER_ADV_STATE_IDLE)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    init_bearer_structure(p_pb_adv, link_timeout_us);

    /* Set initial link values */
    rand_hw_rng_get((uint8_t*) &p_pb_adv->link_id, sizeof(p_pb_adv->link_id));

    p_pb_adv->transaction_out = PB_ADV_TRANSACTION_NUMBER_PROVISIONER_START;
    p_pb_adv->transaction_in  = PB_ADV_TRANSACTION_NUMBER_PROVISIONEE_START;

    /* Send packet */
    uint32_t status = send_link_open(p_pb_adv, p_peer_uuid);

    if (status == NRF_SUCCESS)
    {
        /* Start the link timeout timer: */
        reset_timeout_timer(p_pb_adv);

        bearer_adv_adv_start(&p_pb_adv->advertiser);
        add_active_bearer(p_pb_adv);
        p_pb_adv->state = PROV_BEARER_ADV_STATE_LINK_OPENING;
    }

    return status;
}

static void prov_bearer_adv_link_close(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason)
{
    NRF_MESH_ASSERT(p_bearer != NULL);
    prov_bearer_adv_t * p_pb_adv = &p_bearer->bearer.pb_adv;

    /* We do not expect a close reason that is not defined by the enum */
    NRF_MESH_ASSERT(NRF_MESH_PROV_LINK_CLOSE_REASON_LAST >= close_reason);


    /* PB-remote does not track the link state. */
    if (p_pb_adv->state == PROV_BEARER_ADV_STATE_IDLE ||
        p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_CLOSING)
    {
        return;
    }

    /* Ensure the correct state: */
    NRF_MESH_ASSERT(p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN ||
                    p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPENING);

    if (send_link_close(p_pb_adv, close_reason) == NRF_SUCCESS)
    {
        p_pb_adv->state = PROV_BEARER_ADV_STATE_LINK_CLOSING;
        p_pb_adv->close_reason = close_reason;
    }
    else
    {
        /* We didn't send the link close packets, so there's no reason to wait
         * for the adv queue empty callback. */
        close_link(p_pb_adv, close_reason);
    }
}

static uint32_t prov_bearer_adv_tx(prov_bearer_t * p_bearer, const uint8_t * p_data, uint16_t length)
{
    prov_bearer_adv_t * p_pb_adv = &p_bearer->bearer.pb_adv;

    if (p_pb_adv->state != PROV_BEARER_ADV_STATE_LINK_OPEN)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if (length > PROV_PDU_MAX_LENGTH)
    {
        return NRF_ERROR_INVALID_LENGTH;
    }
    if (p_pb_adv->buffer.state != PROV_BEARER_ADV_BUF_STATE_UNUSED)
    {
        return NRF_ERROR_BUSY;
    }

    reset_timeout_timer(p_pb_adv);

    /* Add the time we'll spend transmitting the packets to the retry interval. */
    uint32_t time_now = timer_now();
    uint32_t retry_interval = PROV_BEARER_ADV_TRANSACTION_BASE_RETRY_INTERVAL_US
        + (transaction_total_segment_count_get(length) * (p_pb_adv->advertiser.adv_int_max_ms * 1000));
    p_pb_adv->timeout_event.interval = retry_interval;
    p_pb_adv->timeout_event.cb = tx_retry_cb;
    timer_sch_reschedule(&p_pb_adv->timeout_event, time_now + retry_interval);

    p_pb_adv->sar_timeout = time_now + PROV_BEARER_ADV_TRANSACTION_TIMEOUT_US;
    p_pb_adv->timeout_event.p_context = p_pb_adv;
    p_pb_adv->buffer.finished_segments = 0;
    p_pb_adv->buffer.state = PROV_BEARER_ADV_BUF_STATE_TX;
    p_pb_adv->buffer.length = length;
    p_pb_adv->buffer.fcs = calculate_3GPP_CRC(p_data, length);
    memcpy(p_pb_adv->buffer.payload, p_data, length);

    prov_buffer_tx(p_pb_adv);
    return NRF_SUCCESS;
}

/*****************************************************************************
 * Public API functions
 *****************************************************************************/

const prov_bearer_interface_t * prov_bearer_adv_interface_get(void)
{
    static const prov_bearer_interface_t interface =
    {
        .tx = prov_bearer_adv_tx,
        .listen_start = prov_bearer_adv_listen,
        .listen_stop = prov_bearer_adv_listen_stop,
        .link_open = prov_bearer_adv_link_open,
        .link_close = prov_bearer_adv_link_close
    };
    return &interface;
}

void prov_bearer_adv_pkt_in(const ble_ad_data_t * p_incoming)
{
    NRF_MESH_ASSERT(p_incoming != NULL);
    NRF_MESH_ASSERT(p_incoming->type == AD_TYPE_PB_ADV);

    pb_adv_pdu_t * p_packet = (pb_adv_pdu_t *) p_incoming->data;
    uint32_t length = p_incoming->length - sizeof(p_incoming->type);

    prov_bearer_adv_t * p_pb_adv = get_bearer_from_link_id(BE2LE32(p_packet->link_id));

    switch (p_packet->pdu.control)
    {
        case PB_ADV_PACKET_C_TRANSACTION_START:
            if (p_pb_adv != NULL && p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN)
            {
                handle_transaction_start_packet(p_pb_adv, p_packet, length);
            }
            break;
        case PB_ADV_PACKET_C_TRANSACTION_ACK:
            if (p_pb_adv != NULL && p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN)
            {
                handle_transaction_ack_packet(p_pb_adv, p_packet);
            }
            break;
        case PB_ADV_PACKET_C_TRANSACTION_CONTINUE:
            if (p_pb_adv != NULL && p_pb_adv->state == PROV_BEARER_ADV_STATE_LINK_OPEN)
            {
                handle_transaction_continuation_packet(p_pb_adv, p_packet, length);
            }
            break;
        case PB_ADV_PACKET_C_CONTROL:
            handle_control_packet(p_pb_adv, p_packet, length);
            break;
        default:
            /* Ignore */
            break;
    }
}
